# Dockerfile

# 1. Базовый образ
# Используем официальный образ Python той же версии, что и у вас (3.11),
# 'slim' версия - легковесная и содержит все необходимое.
FROM python:3.11-slim

# 2. Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# 3. Копируем файл с зависимостями и устанавливаем их
# Этот шаг кэшируется, чтобы не переустанавливать пакеты при каждой сборке,
# если requirements.txt не менялся.
COPY requirements.txt .
RUN pip install --no-cache-dir -r requirements.txt

# 4. Копируем все остальные файлы проекта (bot.py, models.py)
COPY . .

# 5. Команда, которая будет выполняться при запуске контейнера
CMD ["python", "bot.py"]
